ngocthanhtnt/ledshow/ ledshow --username hzy1981/STM32/Usr/app/LED_Scan.c
  Row = (INT8U)(((INT8S)Screen_Status.Scan_Row + Screen_Para.Scan_Para.Line_Order) % Screen_Para.Scan_Para.Rows);
    
  SET_A((Row & 0x01));
  SET_B(((Row & 0x02) >> 1));
  SET_C(((Row & 0x04) >> 2));
  SET_D(((Row & 0x08) >> 3));
}
                        
//调用该函数每次扫描一行
//每中断一次调用一次该函数
void LED_Scan_One_Row(void)
{
  INT16U i,j,k,m,Cols;
  INT16U Blocks;
  //INT32U Row_Freq;
  
  if(Screen_Status.Open_Flag EQ 0 || Screen_Status.Com_Time > 0) //关机状态，不显示,或当前在通信状态也不显示
    return;
 
  //return;
  //_USART_Cmd(USART1, DISABLE); 
  Set_Clock_Hight_Speed(); //设置为高速运行模式
  //_USART_Cmd(USART1, ENABLE);
  //_USART_Cmd(USART1, DISABLE);
  if(Screen_Para.Scan_Para.Rows EQ 0)
  {
	Screen_Para.Scan_Para.Rows = 16;
	SET_SUM(Screen_Para);
  }

  //Block数可以理解为单元板纵向的个数
  Blocks = Screen_Para.Base_Para.Height / (Screen_Para.Scan_Para.Rows * (Screen_Para.Scan_Para.Rows_Fold + 1)); //1.2.4.8.16扫？
 
  if(Blocks > MAX_SCAN_BLOCK_NUM)
	 Blocks = MAX_SCAN_BLOCK_NUM;

  Cols = Screen_Para.Base_Para.Width / 8;
  //对每个Blocks进行扫描
  //每一条扫描线需要Screen_Para.Base_Para.Width / 8 * Screen_Para.Scan_Para.Rows_Fold个字节
  for(i = 0; i < Cols * (Screen_Para.Scan_Para.Rows_Fold + 1); i ++)
  {
    //对每个Block的每条扫描线同时输出一个字节
    for(j = 0; j < Blocks; j++)
    {
    //获取该扫描线上的所有字节并输出
      Get_Shift_Data(j, \
              Screen_Para.Scan_Para.Rows, \
              Screen_Status.Scan_Row,\
              Cols, \
              i, \
              Screen_Para.Scan_Para.Direct, \
              Screen_Para.Scan_Para.Rows_Fold, \
              Screen_Para.Scan_Para.Cols_Fold,\
              Screen_Status.Scan_Data[j]);
    }
    
    //对所有的block输出一个字节
    //如果是从左向右，应该先输出高位再输出低位
    if(Screen_Para.Scan_Para.Direct EQ 0x00 || Screen_Para.Scan_Para.Direct EQ 0x01)
    {
      for(j = 0; j < 8 ; j++)
      {
	    m = 7 - j;	    

        SET_CLK(0);

        for(k = 0; k < Blocks; k++)
        {
		 SET_SHIFT_BIT(k, Screen_Status.Scan_Data[k], m); 
		}

		SET_CLK(1);
      } 
     }
     else //如果从右往左输出应该先输出低位
     {
       for(j = 0; j < 8 ; j++)
       {
		 SET_CLK(0);
        
         for(k = 0; k < Blocks; k++)
         {
	 	   SET_SHIFT_BIT(k, Screen_Status.Scan_Data[k], j);
		 }
        
		 SET_CLK(1);
       }      
     }
	}
	 
	//关闭OE使能
	//Set_OE_Duty_Polarity(0, Screen_Para.Scan_Para.OE_Polarity);

	if(Screen_Para.Scan_Para.Line_Hide > 0)
	  _Delay_us(Screen_Para.Scan_Para.Line_Hide*10); //行消隐时间

    SET_LAT(0); //锁存信号输出
    SET_LAT(1); //锁存信号输出
    
    Set_Block_Row(Screen_Status.Scan_Row);
    Screen_Status.Scan_Row++;
    if(Screen_Status.Scan_Row >= Screen_Para.Scan_Para.Rows)
      Screen_Status.Scan_Row = 0;
	
	//重新打开OE
	//Set_OE_Duty_Polarity(Screen_Status.Lightness, Screen_Para.Scan_Para.OE_Polarity);
	//_USART_Cmd(USART1, DISABLE);
    Set_Clock_Normal_Speed();
	//_USART_Cmd(USART1, ENABLE); 
	//USART_Clar
   
}
